# ExportTexture Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWFExportOptions..::..ExportTexture Property
DWFExportOptions Class See Also
---
Whether to export texture.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015 Subscription Update
# Syntax
C#
---
```text
public bool ExportTexture { get; set; }
```

Visual Basic
---
```text
Public Property ExportTexture As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ExportTexture {
	bool get ();
	void set (bool value);
}
```

# Remarks
The default value is true. This property only take effect to 3D DWF.
# See Also
DWFExportOptions Class
Autodesk.Revit.DB Namespace